namespace CryptoLib.DES.Modes
{
    /// <summary>
    /// Режимы дополнения (padding) для блочных шифров
    /// </summary>
    public enum PaddingMode
    {
        /// <summary>
        /// <para><b>Дополнение нулями (Zeros Padding).</b></para>
        /// <para>Правило: Все недостающие байты до конца блока заполняются нулями (0x00).</para>
        /// <para>Пример (нужно 3 байта): <c>... DD DD DD 00 00 00</c></para>
        /// </summary>
        Zeros,
        
        /// <summary>
        /// <para><b>Стандарт ANSI X.923.</b></para>
        /// <para>Правило: Все байты дополнения, кроме последнего, заполняются нулями (0x00). В самый последний байт записывается значение, равное общему количеству добавленных байт.</para>
        /// <para>Пример (нужно 3 байта): <c>... DD DD DD 00 00 03</c></para>
        /// <para>Пример (нужно 5 байт): <c>... DD DD DD 00 00 00 00 05</c></para>
        /// </summary>
        ANSIX923,
        
        /// <summary>
        /// <para><b>Стандарт PKCS#7 (Public-Key Cryptography Standards #7).</b></para>
        /// <para>Правило: Каждый байт дополнения заполняется значением, равным общему количеству добавленных байт.</para>
        /// <para>Пример (нужно 3 байта): <c>... DD DD DD 03 03 03</c></para>
        /// <para>Пример (нужно 5 байт): <c>... DD DD DD 05 05 05 05 05</c></para>
        /// <para>Особенность: Паддинг добавляется всегда. Если длина данных кратна размеру блока, добавляется целый новый блок паддинга (например, <c>08 08 08 08 08 08 08 08</c> для 8-байтного блока).</para>
        /// </summary>
        PKCS7,
        
        /// <summary>
        /// <para><b>Стандарт ISO 10126.</b></para>
        /// <para>Правило: Все байты дополнения, кроме последнего, заполняются случайными значениями. В самый последний байт записывается значение, равное общему количеству добавленных байт.</para>
        /// <para>Пример (нужно 3 байта): <c>... DD DD DD R1 R2 03</c> (где R1, R2 - случайные байты)</para>
        /// <para>Пример (нужно 5 байт): <c>... DD DD DD R1 R2 R3 R4 05</c></para>
        /// </summary>
        ISO10126
    }
}